{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 22,
   "metadata": {},
   "outputs": [],
   "source": [
    "import nest_asyncio\n",
    "\n",
    "nest_asyncio.apply()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 31,
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.FeatureDeprecationWarning} {category: DEPRECATION} {title: This feature is deprecated and will be removed in future versions.} {description: The procedure has a deprecated field. ('config' used by 'apoc.meta.graphSample' is deprecated.)} {position: line: 1, column: 1, offset: 0} for query: \"CALL apoc.meta.graphSample() YIELD nodes, relationships RETURN nodes, [rel in relationships | {name:apoc.any.property(rel, 'type'), count: apoc.any.property(rel, 'count')}] AS relationships\"\n"
     ]
    }
   ],
   "source": [
    "from llama_index.graph_stores.neo4j import Neo4jPGStore\n",
    "import os\n",
    "from dotenv import load_dotenv\n",
    "\n",
    "load_dotenv()\n",
    "\n",
    "username = os.getenv('NEO4J_USERNAME')\n",
    "password = os.getenv('NEO4J_PASSWORD')\n",
    "url = os.getenv('NEO4J_URL')\n",
    "\n",
    "graph_store = Neo4jPGStore(\n",
    "    username=username,\n",
    "    password=password,\n",
    "    url=url,\n",
    ")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [],
   "source": [
    "import os\n",
    "\n",
    "os.environ[\"OPENAI_API_KEY\"] = os.getenv('OPENAI_API_KEY')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>title</th>\n",
       "      <th>date</th>\n",
       "      <th>text</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Chevron: Best Of Breed</td>\n",
       "      <td>2031-04-06T01:36:32.000000000+00:00</td>\n",
       "      <td>JHVEPhoto Like many companies in the O&amp;G secto...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>FirstEnergy (NYSE:FE) Posts Earnings Results</td>\n",
       "      <td>2030-04-29T06:55:28.000000000+00:00</td>\n",
       "      <td>FirstEnergy (NYSE:FE – Get Rating) posted its ...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Dáil almost suspended after Sinn Féin TD put p...</td>\n",
       "      <td>2023-06-15T14:32:11.000000000+00:00</td>\n",
       "      <td>The Dáil was almost suspended on Thursday afte...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Epic’s latest tool can animate hyperrealistic ...</td>\n",
       "      <td>2023-06-15T14:00:00.000000000+00:00</td>\n",
       "      <td>Today, Epic is releasing a new tool designed t...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>EU to Ban Huawei, ZTE from Internal Commission...</td>\n",
       "      <td>2023-06-15T13:50:00.000000000+00:00</td>\n",
       "      <td>The European Commission is planning to ban equ...</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                               title  \\\n",
       "0                             Chevron: Best Of Breed   \n",
       "1       FirstEnergy (NYSE:FE) Posts Earnings Results   \n",
       "2  Dáil almost suspended after Sinn Féin TD put p...   \n",
       "3  Epic’s latest tool can animate hyperrealistic ...   \n",
       "4  EU to Ban Huawei, ZTE from Internal Commission...   \n",
       "\n",
       "                                  date  \\\n",
       "0  2031-04-06T01:36:32.000000000+00:00   \n",
       "1  2030-04-29T06:55:28.000000000+00:00   \n",
       "2  2023-06-15T14:32:11.000000000+00:00   \n",
       "3  2023-06-15T14:00:00.000000000+00:00   \n",
       "4  2023-06-15T13:50:00.000000000+00:00   \n",
       "\n",
       "                                                text  \n",
       "0  JHVEPhoto Like many companies in the O&G secto...  \n",
       "1  FirstEnergy (NYSE:FE – Get Rating) posted its ...  \n",
       "2  The Dáil was almost suspended on Thursday afte...  \n",
       "3  Today, Epic is releasing a new tool designed t...  \n",
       "4  The European Commission is planning to ban equ...  "
      ]
     },
     "execution_count": 4,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "import pandas as pd\n",
    "from llama_index.core import Document\n",
    "\n",
    "news = pd.read_csv(\"https://raw.githubusercontent.com/tomasonjo/blog-datasets/main/news_articles.csv\")\n",
    "documents = [Document(text=f\"{row['title']}: {row['text']}\") for i, row in news.iterrows()]\n",
    "news.head()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [],
   "source": [
    "from llama_index.embeddings.openai import OpenAIEmbedding\n",
    "from llama_index.llms.openai import OpenAI\n",
    "\n",
    "llm = OpenAI(model=\"gpt-4o\", temperature=0.0)\n",
    "embed_model = OpenAIEmbedding(model_name=\"text-embedding-3-small\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {},
   "outputs": [],
   "source": [
    "from typing import Literal\n",
    "from llama_index.core.indices.property_graph import SchemaLLMPathExtractor\n",
    "\n",
    "# best practice to use upper-case\n",
    "entities = Literal[\"PERSON\", \"LOCATION\", \"ORGANIZATION\", \"PRODUCT\", \"EVENT\"]\n",
    "relations = Literal[\n",
    "    \"SUPPLIER_OF\",\n",
    "    \"COMPETITOR\",\n",
    "    \"PARTNERSHIP\",\n",
    "    \"ACQUISITION\",\n",
    "    \"WORKS_AT\",\n",
    "    \"SUBSIDIARY\",\n",
    "    \"BOARD_MEMBER\",\n",
    "    \"CEO\",\n",
    "    \"PROVIDES\",\n",
    "    \"HAS_EVENT\",\n",
    "    \"IN_LOCATION\",\n",
    "]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {},
   "outputs": [],
   "source": [
    "# define which entities can have which relations\n",
    "validation_schema = {\n",
    "    \"Person\": [\"WORKS_AT\", \"BOARD_MEMBER\", \"CEO\", \"HAS_EVENT\"],\n",
    "    \"Organization\": [\n",
    "        \"SUPPLIER_OF\",\n",
    "        \"COMPETITOR\",\n",
    "        \"PARTNERSHIP\",\n",
    "        \"ACQUISITION\",\n",
    "        \"WORKS_AT\",\n",
    "        \"SUBSIDIARY\",\n",
    "        \"BOARD_MEMBER\",\n",
    "        \"CEO\",\n",
    "        \"PROVIDES\",\n",
    "        \"HAS_EVENT\",\n",
    "        \"IN_LOCATION\",\n",
    "    ],\n",
    "    \"Product\": [\"PROVIDES\"],\n",
    "    \"Event\": [\"HAS_EVENT\", \"IN_LOCATION\"],\n",
    "    \"Location\": [\"HAPPENED_AT\", \"IN_LOCATION\"],\n",
    "}"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "Parsing nodes: 100%|██████████| 250/250 [00:00<00:00, 2326.02it/s]\n",
      "Extracting paths from text with schema:  24%|██▍       | 61/250 [01:16<03:06,  1.01it/s]Retrying llama_index.llms.openai.base.OpenAI._achat in 0.10506541233035316 seconds as it raised RateLimitError: Error code: 429 - {'error': {'message': 'Rate limit reached for gpt-4o in organization org-OxQFpyLWgSN1Jf6A5aXj9wI4 on tokens per min (TPM): Limit 30000, Used 29878, Requested 896. Please try again in 1.548s. Visit https://platform.openai.com/account/rate-limits to learn more.', 'type': 'tokens', 'param': None, 'code': 'rate_limit_exceeded'}}.\n",
      "Extracting paths from text with schema:  25%|██▌       | 63/250 [01:20<04:27,  1.43s/it]Retrying llama_index.llms.openai.base.OpenAI._achat in 0.8273630725821677 seconds as it raised RateLimitError: Error code: 429 - {'error': {'message': 'Rate limit reached for gpt-4o in organization org-OxQFpyLWgSN1Jf6A5aXj9wI4 on tokens per min (TPM): Limit 30000, Used 29503, Requested 896. Please try again in 798ms. Visit https://platform.openai.com/account/rate-limits to learn more.', 'type': 'tokens', 'param': None, 'code': 'rate_limit_exceeded'}}.\n",
      "Extracting paths from text with schema:  30%|██▉       | 74/250 [01:36<03:48,  1.30s/it]Retrying llama_index.llms.openai.base.OpenAI._achat in 0.16842395478356553 seconds as it raised RateLimitError: Error code: 429 - {'error': {'message': 'Rate limit reached for gpt-4o in organization org-OxQFpyLWgSN1Jf6A5aXj9wI4 on tokens per min (TPM): Limit 30000, Used 29327, Requested 765. Please try again in 184ms. Visit https://platform.openai.com/account/rate-limits to learn more.', 'type': 'tokens', 'param': None, 'code': 'rate_limit_exceeded'}}.\n",
      "Extracting paths from text with schema:  33%|███▎      | 83/250 [01:50<04:35,  1.65s/it]Retrying llama_index.llms.openai.base.OpenAI._achat in 0.23126766834977408 seconds as it raised RateLimitError: Error code: 429 - {'error': {'message': 'Rate limit reached for gpt-4o in organization org-OxQFpyLWgSN1Jf6A5aXj9wI4 on tokens per min (TPM): Limit 30000, Used 29492, Requested 983. Please try again in 950ms. Visit https://platform.openai.com/account/rate-limits to learn more.', 'type': 'tokens', 'param': None, 'code': 'rate_limit_exceeded'}}.\n",
      "Extracting paths from text with schema:  34%|███▎      | 84/250 [01:50<03:49,  1.38s/it]Retrying llama_index.llms.openai.base.OpenAI._achat in 0.647249445841108 seconds as it raised RateLimitError: Error code: 429 - {'error': {'message': 'Rate limit reached for gpt-4o in organization org-OxQFpyLWgSN1Jf6A5aXj9wI4 on tokens per min (TPM): Limit 30000, Used 29902, Requested 983. Please try again in 1.77s. Visit https://platform.openai.com/account/rate-limits to learn more.', 'type': 'tokens', 'param': None, 'code': 'rate_limit_exceeded'}}.\n",
      "Extracting paths from text with schema:  38%|███▊      | 95/250 [02:09<03:15,  1.26s/it]Retrying llama_index.llms.openai.base.OpenAI._achat in 0.4153905404972845 seconds as it raised RateLimitError: Error code: 429 - {'error': {'message': 'Rate limit reached for gpt-4o in organization org-OxQFpyLWgSN1Jf6A5aXj9wI4 on tokens per min (TPM): Limit 30000, Used 29847, Requested 992. Please try again in 1.678s. Visit https://platform.openai.com/account/rate-limits to learn more.', 'type': 'tokens', 'param': None, 'code': 'rate_limit_exceeded'}}.\n",
      "Extracting paths from text with schema:  42%|████▏     | 105/250 [02:26<03:29,  1.45s/it]Retrying llama_index.llms.openai.base.OpenAI._achat in 0.0998330917910425 seconds as it raised RateLimitError: Error code: 429 - {'error': {'message': 'Rate limit reached for gpt-4o in organization org-OxQFpyLWgSN1Jf6A5aXj9wI4 on tokens per min (TPM): Limit 30000, Used 29895, Requested 937. Please try again in 1.664s. Visit https://platform.openai.com/account/rate-limits to learn more.', 'type': 'tokens', 'param': None, 'code': 'rate_limit_exceeded'}}.\n",
      "Retrying llama_index.llms.openai.base.OpenAI._achat in 0.08545986264749339 seconds as it raised RateLimitError: Error code: 429 - {'error': {'message': 'Rate limit reached for gpt-4o in organization org-OxQFpyLWgSN1Jf6A5aXj9wI4 on tokens per min (TPM): Limit 30000, Used 29821, Requested 1011. Please try again in 1.664s. Visit https://platform.openai.com/account/rate-limits to learn more.', 'type': 'tokens', 'param': None, 'code': 'rate_limit_exceeded'}}.\n",
      "Extracting paths from text with schema:  43%|████▎     | 107/250 [02:32<05:22,  2.26s/it]Retrying llama_index.llms.openai.base.OpenAI._achat in 1.2580909120068255 seconds as it raised RateLimitError: Error code: 429 - {'error': {'message': 'Rate limit reached for gpt-4o in organization org-OxQFpyLWgSN1Jf6A5aXj9wI4 on tokens per min (TPM): Limit 30000, Used 29478, Requested 1011. Please try again in 977ms. Visit https://platform.openai.com/account/rate-limits to learn more.', 'type': 'tokens', 'param': None, 'code': 'rate_limit_exceeded'}}.\n",
      "Retrying llama_index.llms.openai.base.OpenAI._achat in 0.1582464905786959 seconds as it raised RateLimitError: Error code: 429 - {'error': {'message': 'Rate limit reached for gpt-4o in organization org-OxQFpyLWgSN1Jf6A5aXj9wI4 on tokens per min (TPM): Limit 30000, Used 29576, Requested 956. Please try again in 1.064s. Visit https://platform.openai.com/account/rate-limits to learn more.', 'type': 'tokens', 'param': None, 'code': 'rate_limit_exceeded'}}.\n",
      "Extracting paths from text with schema:  48%|████▊     | 120/250 [02:54<03:39,  1.69s/it]Retrying llama_index.llms.openai.base.OpenAI._achat in 0.24121416844579058 seconds as it raised RateLimitError: Error code: 429 - {'error': {'message': 'Rate limit reached for gpt-4o in organization org-OxQFpyLWgSN1Jf6A5aXj9wI4 on tokens per min (TPM): Limit 30000, Used 29510, Requested 835. Please try again in 690ms. Visit https://platform.openai.com/account/rate-limits to learn more.', 'type': 'tokens', 'param': None, 'code': 'rate_limit_exceeded'}}.\n",
      "Extracting paths from text with schema:  59%|█████▉    | 148/250 [03:38<02:31,  1.49s/it]Retrying llama_index.llms.openai.base.OpenAI._achat in 0.510000257200483 seconds as it raised RateLimitError: Error code: 429 - {'error': {'message': 'Rate limit reached for gpt-4o in organization org-OxQFpyLWgSN1Jf6A5aXj9wI4 on tokens per min (TPM): Limit 30000, Used 29514, Requested 921. Please try again in 870ms. Visit https://platform.openai.com/account/rate-limits to learn more.', 'type': 'tokens', 'param': None, 'code': 'rate_limit_exceeded'}}.\n",
      "Extracting paths from text with schema:  60%|██████    | 150/250 [03:43<03:14,  1.94s/it]Retrying llama_index.llms.openai.base.OpenAI._achat in 1.8459932554450607 seconds as it raised RateLimitError: Error code: 429 - {'error': {'message': 'Rate limit reached for gpt-4o in organization org-OxQFpyLWgSN1Jf6A5aXj9wI4 on tokens per min (TPM): Limit 30000, Used 29542, Requested 921. Please try again in 926ms. Visit https://platform.openai.com/account/rate-limits to learn more.', 'type': 'tokens', 'param': None, 'code': 'rate_limit_exceeded'}}.\n",
      "Extracting paths from text with schema:  61%|██████    | 153/250 [03:49<03:09,  1.96s/it]Retrying llama_index.llms.openai.base.OpenAI._achat in 0.3118396070115965 seconds as it raised RateLimitError: Error code: 429 - {'error': {'message': 'Rate limit reached for gpt-4o in organization org-OxQFpyLWgSN1Jf6A5aXj9wI4 on tokens per min (TPM): Limit 30000, Used 29669, Requested 1078. Please try again in 1.494s. Visit https://platform.openai.com/account/rate-limits to learn more.', 'type': 'tokens', 'param': None, 'code': 'rate_limit_exceeded'}}.\n",
      "Extracting paths from text with schema:  62%|██████▏   | 156/250 [03:54<02:27,  1.57s/it]Retrying llama_index.llms.openai.base.OpenAI._achat in 0.7580809054047917 seconds as it raised RateLimitError: Error code: 429 - {'error': {'message': 'Rate limit reached for gpt-4o in organization org-OxQFpyLWgSN1Jf6A5aXj9wI4 on tokens per min (TPM): Limit 30000, Used 29578, Requested 701. Please try again in 558ms. Visit https://platform.openai.com/account/rate-limits to learn more.', 'type': 'tokens', 'param': None, 'code': 'rate_limit_exceeded'}}.\n",
      "Extracting paths from text with schema:  75%|███████▌  | 188/250 [04:45<01:17,  1.25s/it]Retrying llama_index.llms.openai.base.OpenAI._achat in 0.4731463591888959 seconds as it raised RateLimitError: Error code: 429 - {'error': {'message': 'Rate limit reached for gpt-4o in organization org-OxQFpyLWgSN1Jf6A5aXj9wI4 on tokens per min (TPM): Limit 30000, Used 29946, Requested 952. Please try again in 1.796s. Visit https://platform.openai.com/account/rate-limits to learn more.', 'type': 'tokens', 'param': None, 'code': 'rate_limit_exceeded'}}.\n",
      "Retrying llama_index.llms.openai.base.OpenAI._achat in 0.5989110464463965 seconds as it raised RateLimitError: Error code: 429 - {'error': {'message': 'Rate limit reached for gpt-4o in organization org-OxQFpyLWgSN1Jf6A5aXj9wI4 on tokens per min (TPM): Limit 30000, Used 29308, Requested 863. Please try again in 342ms. Visit https://platform.openai.com/account/rate-limits to learn more.', 'type': 'tokens', 'param': None, 'code': 'rate_limit_exceeded'}}.\n",
      "Extracting paths from text with schema:  82%|████████▏ | 205/250 [05:13<00:58,  1.30s/it]Retrying llama_index.llms.openai.base.OpenAI._achat in 0.9928866288575082 seconds as it raised RateLimitError: Error code: 429 - {'error': {'message': 'Rate limit reached for gpt-4o in organization org-OxQFpyLWgSN1Jf6A5aXj9wI4 on tokens per min (TPM): Limit 30000, Used 29674, Requested 952. Please try again in 1.252s. Visit https://platform.openai.com/account/rate-limits to learn more.', 'type': 'tokens', 'param': None, 'code': 'rate_limit_exceeded'}}.\n",
      "Extracting paths from text with schema:  83%|████████▎ | 208/250 [05:19<01:06,  1.59s/it]Retrying llama_index.llms.openai.base.OpenAI._achat in 0.5948946396034301 seconds as it raised RateLimitError: Error code: 429 - {'error': {'message': 'Rate limit reached for gpt-4o in organization org-OxQFpyLWgSN1Jf6A5aXj9wI4 on tokens per min (TPM): Limit 30000, Used 29664, Requested 716. Please try again in 760ms. Visit https://platform.openai.com/account/rate-limits to learn more.', 'type': 'tokens', 'param': None, 'code': 'rate_limit_exceeded'}}.\n",
      "Extracting paths from text with schema:  84%|████████▍ | 210/250 [05:22<01:04,  1.61s/it]Retrying llama_index.llms.openai.base.OpenAI._achat in 0.8251117962980761 seconds as it raised RateLimitError: Error code: 429 - {'error': {'message': 'Rate limit reached for gpt-4o in organization org-OxQFpyLWgSN1Jf6A5aXj9wI4 on tokens per min (TPM): Limit 30000, Used 29755, Requested 716. Please try again in 941ms. Visit https://platform.openai.com/account/rate-limits to learn more.', 'type': 'tokens', 'param': None, 'code': 'rate_limit_exceeded'}}.\n",
      "Extracting paths from text with schema:  87%|████████▋ | 217/250 [05:33<00:51,  1.55s/it]Retrying llama_index.llms.openai.base.OpenAI._achat in 0.12293469502566012 seconds as it raised RateLimitError: Error code: 429 - {'error': {'message': 'Rate limit reached for gpt-4o in organization org-OxQFpyLWgSN1Jf6A5aXj9wI4 on tokens per min (TPM): Limit 30000, Used 29785, Requested 715. Please try again in 1s. Visit https://platform.openai.com/account/rate-limits to learn more.', 'type': 'tokens', 'param': None, 'code': 'rate_limit_exceeded'}}.\n",
      "Extracting paths from text with schema:  88%|████████▊ | 219/250 [05:37<00:55,  1.78s/it]Retrying llama_index.llms.openai.base.OpenAI._achat in 0.24079534349441978 seconds as it raised RateLimitError: Error code: 429 - {'error': {'message': 'Rate limit reached for gpt-4o in organization org-OxQFpyLWgSN1Jf6A5aXj9wI4 on tokens per min (TPM): Limit 30000, Used 29681, Requested 799. Please try again in 960ms. Visit https://platform.openai.com/account/rate-limits to learn more.', 'type': 'tokens', 'param': None, 'code': 'rate_limit_exceeded'}}.\n",
      "Extracting paths from text with schema:  88%|████████▊ | 221/250 [05:40<00:46,  1.59s/it]Retrying llama_index.llms.openai.base.OpenAI._achat in 0.3767010336486136 seconds as it raised RateLimitError: Error code: 429 - {'error': {'message': 'Rate limit reached for gpt-4o in organization org-OxQFpyLWgSN1Jf6A5aXj9wI4 on tokens per min (TPM): Limit 30000, Used 29481, Requested 970. Please try again in 902ms. Visit https://platform.openai.com/account/rate-limits to learn more.', 'type': 'tokens', 'param': None, 'code': 'rate_limit_exceeded'}}.\n",
      "Extracting paths from text with schema:  89%|████████▉ | 223/250 [05:43<00:40,  1.50s/it]Retrying llama_index.llms.openai.base.OpenAI._achat in 0.010679582124025533 seconds as it raised RateLimitError: Error code: 429 - {'error': {'message': 'Rate limit reached for gpt-4o in organization org-OxQFpyLWgSN1Jf6A5aXj9wI4 on tokens per min (TPM): Limit 30000, Used 29606, Requested 970. Please try again in 1.152s. Visit https://platform.openai.com/account/rate-limits to learn more.', 'type': 'tokens', 'param': None, 'code': 'rate_limit_exceeded'}}.\n",
      "Extracting paths from text with schema:  91%|█████████ | 228/250 [05:52<00:37,  1.69s/it]Retrying llama_index.llms.openai.base.OpenAI._achat in 0.22348877615229867 seconds as it raised RateLimitError: Error code: 429 - {'error': {'message': 'Rate limit reached for gpt-4o in organization org-OxQFpyLWgSN1Jf6A5aXj9wI4 on tokens per min (TPM): Limit 30000, Used 29512, Requested 896. Please try again in 816ms. Visit https://platform.openai.com/account/rate-limits to learn more.', 'type': 'tokens', 'param': None, 'code': 'rate_limit_exceeded'}}.\n",
      "Extracting paths from text with schema:  93%|█████████▎| 233/250 [06:01<00:27,  1.60s/it]Retrying llama_index.llms.openai.base.OpenAI._achat in 0.05290044014014539 seconds as it raised RateLimitError: Error code: 429 - {'error': {'message': 'Rate limit reached for gpt-4o in organization org-OxQFpyLWgSN1Jf6A5aXj9wI4 on tokens per min (TPM): Limit 30000, Used 29827, Requested 692. Please try again in 1.038s. Visit https://platform.openai.com/account/rate-limits to learn more.', 'type': 'tokens', 'param': None, 'code': 'rate_limit_exceeded'}}.\n",
      "Extracting paths from text with schema:  96%|█████████▌| 239/250 [06:11<00:15,  1.38s/it]Retrying llama_index.llms.openai.base.OpenAI._achat in 0.044324712339511074 seconds as it raised RateLimitError: Error code: 429 - {'error': {'message': 'Rate limit reached for gpt-4o in organization org-OxQFpyLWgSN1Jf6A5aXj9wI4 on tokens per min (TPM): Limit 30000, Used 29541, Requested 555. Please try again in 192ms. Visit https://platform.openai.com/account/rate-limits to learn more.', 'type': 'tokens', 'param': None, 'code': 'rate_limit_exceeded'}}.\n",
      "Extracting paths from text with schema:  96%|█████████▋| 241/250 [06:13<00:11,  1.30s/it]Retrying llama_index.llms.openai.base.OpenAI._achat in 1.7289198092941738 seconds as it raised RateLimitError: Error code: 429 - {'error': {'message': 'Rate limit reached for gpt-4o in organization org-OxQFpyLWgSN1Jf6A5aXj9wI4 on tokens per min (TPM): Limit 30000, Used 29804, Requested 555. Please try again in 718ms. Visit https://platform.openai.com/account/rate-limits to learn more.', 'type': 'tokens', 'param': None, 'code': 'rate_limit_exceeded'}}.\n",
      "Extracting paths from text with schema:  97%|█████████▋| 243/250 [06:16<00:09,  1.30s/it]Retrying llama_index.llms.openai.base.OpenAI._achat in 0.5272857433614742 seconds as it raised RateLimitError: Error code: 429 - {'error': {'message': 'Rate limit reached for gpt-4o in organization org-OxQFpyLWgSN1Jf6A5aXj9wI4 on tokens per min (TPM): Limit 30000, Used 29874, Requested 783. Please try again in 1.314s. Visit https://platform.openai.com/account/rate-limits to learn more.', 'type': 'tokens', 'param': None, 'code': 'rate_limit_exceeded'}}.\n",
      "Extracting paths from text with schema: 100%|██████████| 250/250 [06:30<00:00,  1.56s/it]\n",
      "Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.UnknownPropertyKeyWarning} {category: UNRECOGNIZED} {title: The provided property key is not in the database} {description: One of the property names in your query is not available in the database, make sure you didn't misspell it or that the label is available when you run this statement in your application (the missing property name is: id)} {position: line: 1, column: 19, offset: 18} for query: \"MATCH (e) WHERE e.id in $ids \\n        WITH e\\n        RETURN e.id AS name,\\n               [l in labels(e) WHERE l <> '__Entity__' | l][0] AS type,\\n               e{.* , embedding: Null, id: Null} AS properties\\n        \"\n",
      "Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.UnknownPropertyKeyWarning} {category: UNRECOGNIZED} {title: The provided property key is not in the database} {description: One of the property names in your query is not available in the database, make sure you didn't misspell it or that the label is available when you run this statement in your application (the missing property name is: id)} {position: line: 3, column: 18, offset: 62} for query: \"MATCH (e) WHERE e.id in $ids \\n        WITH e\\n        RETURN e.id AS name,\\n               [l in labels(e) WHERE l <> '__Entity__' | l][0] AS type,\\n               e{.* , embedding: Null, id: Null} AS properties\\n        \"\n",
      "Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.UnknownPropertyKeyWarning} {category: UNRECOGNIZED} {title: The provided property key is not in the database} {description: One of the property names in your query is not available in the database, make sure you didn't misspell it or that the label is available when you run this statement in your application (the missing property name is: id)} {position: line: 1, column: 19, offset: 18} for query: \"MATCH (e) WHERE e.id in $ids \\n        WITH e\\n        RETURN e.id AS name,\\n               [l in labels(e) WHERE l <> '__Entity__' | l][0] AS type,\\n               e{.* , embedding: Null, id: Null} AS properties\\n        \"\n",
      "Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.UnknownPropertyKeyWarning} {category: UNRECOGNIZED} {title: The provided property key is not in the database} {description: One of the property names in your query is not available in the database, make sure you didn't misspell it or that the label is available when you run this statement in your application (the missing property name is: id)} {position: line: 3, column: 18, offset: 62} for query: \"MATCH (e) WHERE e.id in $ids \\n        WITH e\\n        RETURN e.id AS name,\\n               [l in labels(e) WHERE l <> '__Entity__' | l][0] AS type,\\n               e{.* , embedding: Null, id: Null} AS properties\\n        \"\n",
      "Generating embeddings: 100%|██████████| 3/3 [00:01<00:00,  2.24it/s]\n",
      "Generating embeddings: 100%|██████████| 46/46 [00:03<00:00, 13.06it/s]\n",
      "Received notification from DBMS server: {severity: WARNING} {code: Neo.ClientNotification.Statement.FeatureDeprecationWarning} {category: DEPRECATION} {title: This feature is deprecated and will be removed in future versions.} {description: The procedure has a deprecated field. ('config' used by 'apoc.meta.graphSample' is deprecated.)} {position: line: 1, column: 1, offset: 0} for query: \"CALL apoc.meta.graphSample() YIELD nodes, relationships RETURN nodes, [rel in relationships | {name:apoc.any.property(rel, 'type'), count: apoc.any.property(rel, 'count')}] AS relationships\"\n"
     ]
    }
   ],
   "source": [
    "from llama_index.core import PropertyGraphIndex\n",
    "\n",
    "kg_extractor = SchemaLLMPathExtractor(\n",
    "    llm=llm,\n",
    "    possible_entities=entities,\n",
    "    possible_relations=relations,\n",
    "    kg_validation_schema=validation_schema,\n",
    "    # if false, allows for values outside of the schema\n",
    "    # useful for using the schema as a suggestion\n",
    "    strict=True,\n",
    ")\n",
    "\n",
    "NUMBER_OF_ARTICLES = 250\n",
    "\n",
    "index = PropertyGraphIndex.from_documents(\n",
    "    documents[:NUMBER_OF_ARTICLES],\n",
    "    kg_extractors=[kg_extractor],\n",
    "    llm=llm,\n",
    "    embed_model=embed_model,\n",
    "    property_graph_store=graph_store,\n",
    "    show_progress=True,\n",
    ")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 13,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "graph_store.structured_query(\"\"\"\n",
    "CREATE VECTOR INDEX entity IF NOT EXISTS\n",
    "FOR (m:`__Entity__`)\n",
    "ON m.embedding\n",
    "OPTIONS {indexConfig: {\n",
    " `vector.dimensions`: 1536,\n",
    " `vector.similarity_function`: 'cosine'\n",
    "}}\n",
    "\"\"\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "{'combinedResult': ['Stock', 'stock']}\n",
      "{'combinedResult': ['firefighters debate', 'firefighters dispute']}\n",
      "{'combinedResult': ['MetaHuman', 'MetaHuman Animator']}\n",
      "{'combinedResult': ['XPeng', 'XPeng Inc', 'Xpeng']}\n",
      "{'combinedResult': ['Bank of America', 'Bank of America Corp.']}\n",
      "{'combinedResult': ['tools for rent reporting and data solutions', 'tools for rent reporting and data solutions for credit building']}\n",
      "{'combinedResult': ['Hyatt', 'Hyatt Corporation', 'Hyatt Hotels']}\n",
      "{'combinedResult': ['Star Ocean', 'Star Ocean 2', 'Star Ocean 2 remake', 'Star Ocean The Second Story', 'Star Ocean: The Second Story', 'Star Ocean: The Second Story R']}\n",
      "{'combinedResult': ['logo leak', 'logo leaked']}\n",
      "{'combinedResult': ['Star Ocean First Departure R', 'Star Ocean: First Departure R']}\n",
      "{'combinedResult': ['support.na.square-enix.com/images/title_banner/title_banner_19285.jpg', 'support.na.square-enix.com/images/title_banner/title_banner_19288.jpg']}\n",
      "{'combinedResult': ['Citigroup', 'Citigroup Inc.']}\n",
      "{'combinedResult': ['Wells Fargo', 'Wells Fargo & Co.']}\n",
      "{'combinedResult': ['JPMorgan', 'JPMorgan Asset Management', 'JPMorgan Chase & Co.']}\n",
      "{'combinedResult': ['CarMax Auto Owner Trust 2019-3', 'CarMax Auto Owner Trust 2019-4']}\n",
      "{'combinedResult': ['333-228379', '333-228379-03', '333-228379-04']}\n",
      "{'combinedResult': ['Newcastle', 'Newcastle United']}\n",
      "{'combinedResult': ['Premier League 2023-24', 'Premier League 2023/2024', 'Premier League 2023/24']}\n",
      "{'combinedResult': ['4GB + 64GB', '6GB + 128GB']}\n",
      "{'combinedResult': ['Press release', 'press release']}\n",
      "{'combinedResult': ['IT Taxi', 'IT taxi']}\n",
      "{'combinedResult': ['Buy rating', 'Hold rating']}\n",
      "{'combinedResult': ['Price Target', 'price target']}\n",
      "{'combinedResult': ['Delta Air Lines', 'Delta Air Lines Inc.']}\n",
      "{'combinedResult': ['suspended dividend', 'suspended dividend in March 2020']}\n",
      "{'combinedResult': ['Baltimore', 'Baltimore Ravens', 'Ravens']}\n",
      "{'combinedResult': ['General Motors', 'General Motors Co.']}\n",
      "{'combinedResult': ['Ford Motor', 'Ford Motor Co.']}\n",
      "{'combinedResult': ['Electric Cars', 'electric-car']}\n",
      "{'combinedResult': ['Alibaba', 'Alibaba Group']}\n",
      "{'combinedResult': ['Aldeyra', 'Aldeyra Therapeutics']}\n",
      "{'combinedResult': ['dividend', 'dividends']}\n",
      "{'combinedResult': ['shareholder return', 'total shareholder return']}\n",
      "{'combinedResult': ['Share Price', 'share price']}\n",
      "{'combinedResult': ['European Commission approval of Rinvoq® for the treatment of Crohn’s disease', 'approval of Rinvoq® for the treatment of Crohn’s disease']}\n",
      "{'combinedResult': ['treatment for non-radiographic axial spondyloarthritis', 'treatment for radiographic axial spondyloarthritis']}\n",
      "{'combinedResult': ['BBC2', 'BBC4']}\n",
      "{'combinedResult': ['New York', 'New York, New York']}\n",
      "{'combinedResult': ['Atlas Air', 'Atlas Air Worldwide', 'Atlas Air Worldwide Holdings Inc.']}\n",
      "{'combinedResult': ['Goldman Sachs', 'Goldman Sachs Group Inc.']}\n",
      "{'combinedResult': ['UTI Asset Management Company', 'UTI Asset Management Company Limited', 'UTI Asset Management Company Ltd']}\n",
      "{'combinedResult': ['June 14, 2023', 'June 15 2023']}\n",
      "{'combinedResult': ['Zee Entertainment', 'Zee Entertainment Enterprises Ltd.']}\n",
      "{'combinedResult': ['replaced Drew Smith', 'replaced by Drew Smith']}\n",
      "{'combinedResult': ['Giants', 'New York Giants']}\n",
      "{'combinedResult': ['Death', 'death']}\n",
      "{'combinedResult': ['Square Enix support site', 'Square Enix support website']}\n",
      "{'combinedResult': ['Australian Opposition Party', 'Australian opposition party']}\n",
      "{'combinedResult': ['Expels Senator Over Sexual Misconduct Allegations', 'expels senator over sexual misconduct allegations']}\n",
      "{'combinedResult': ['BTC Halving', 'Bitcoin Halving', 'Bitcoin Halving 2024']}\n",
      "{'combinedResult': ['Tesla Inc', 'Tesla Inc.']}\n",
      "{'combinedResult': ['Qualcomm', 'Qualcomm Technologies, Inc.']}\n",
      "{'combinedResult': [\"European People's Party\", 'European People’s Party']}\n",
      "{'combinedResult': ['Realme 11 Pro 5G', 'Realme 11 Pro+ 5G']}\n",
      "{'combinedResult': ['bullying, harassment and sexual assault', 'harassment and sexual assault']}\n",
      "{'combinedResult': ['Quarterly Dividend Increase', 'quarterly dividend increase']}\n",
      "{'combinedResult': ['Delhi', 'New Delhi']}\n",
      "{'combinedResult': ['Baja California Sur', 'Baja California Sur, Mexico']}\n",
      "{'combinedResult': ['Airtel', 'Bharti Airtel']}\n",
      "{'combinedResult': ['5G service', '5G services']}\n",
      "{'combinedResult': ['32 GB internal storage', '64 GB internal storage']}\n",
      "{'combinedResult': ['Smart Hub', 'Smart Hub Plus', 'Smart Hub Plus router']}\n",
      "{'combinedResult': ['Smart Wi-Fi', 'Smart Wi-Fi Plus']}\n",
      "{'combinedResult': ['Laser World of Photonics', 'Laser World of Photonics China']}\n",
      "{'combinedResult': ['Apple Podcasts', 'Google Podcasts']}\n",
      "{'combinedResult': ['PH10 SmartWeld+', 'PH20 SmartWeld+']}\n",
      "{'combinedResult': ['Real-time Intelligence', 'real-time intelligence']}\n",
      "{'combinedResult': ['Stock Market Intelligence', 'stock market intelligence']}\n",
      "{'combinedResult': ['Benzinga Pro Community', 'Benzinga Pro community']}\n",
      "{'combinedResult': ['Levi & Korsinsky', 'Levi & Korsinsky, LLP']}\n",
      "{'combinedResult': ['Class Action Lawsuit', 'Class Action Lawsuit Deadline', 'class action lawsuit']}\n",
      "{'combinedResult': ['Legal Services', 'legal services']}\n",
      "{'combinedResult': ['City NGP (Navigation Guided Pilot)', 'City NGP (Navigation Guided Pilot) system']}\n",
      "{'combinedResult': ['Inditex', 'Inditex SA']}\n",
      "{'combinedResult': ['July payment', 'June payment']}\n",
      "{'combinedResult': ['GroupM', 'GroupM India', 'GroupM Nexus', 'GroupM South Asia']}\n",
      "{'combinedResult': ['11,000 charging points', '800 charging points']}\n",
      "{'combinedResult': ['Adani Green Energy', 'Adani Green Energy Limited', 'Adani Green Energy Ltd']}\n",
      "{'combinedResult': ['Ranked among the top 10 companies in the world in the Renewable Energy sector by Sustainalytics', 'ranked among the top 10 companies in the world in the renewable energy sector by Sustainalytics']}\n",
      "{'combinedResult': ['Fujifilm Instax SQ40', 'Instax SQ40']}\n",
      "{'combinedResult': ['Activision Blizzard', 'Activision Blizzard, Inc.']}\n",
      "{'combinedResult': ['Nvidia', 'Nvidia Corp.']}\n",
      "{'combinedResult': [\"Vera's Land Rover\", \"photo of Vera's Land Rover\"]}\n",
      "{'combinedResult': ['$1,751', '$1,785']}\n",
      "{'combinedResult': ['Maleic Anhydride', 'Maleic Anhydride plant']}\n",
      "{'combinedResult': ['Sky Q 1TB UHD box', 'Sky Q 1TB box', 'Sky Q 2TB box']}\n",
      "{'combinedResult': ['Adani Enterprises', 'Adani Enterprises Ltd']}\n",
      "{'combinedResult': ['Adani Ports', 'Adani Ports & SEZ Ltd']}\n",
      "{'combinedResult': ['Adani Total Gas', 'Adani Total Gas Ltd']}\n",
      "{'combinedResult': ['Adani Transmission', 'Adani Transmission Ltd']}\n"
     ]
    }
   ],
   "source": [
    "# Just for inspection\n",
    "similarity_threshold = 0.9\n",
    "word_edit_distance = 5\n",
    "data = graph_store.structured_query(\"\"\"\n",
    "MATCH (e:__Entity__)\n",
    "CALL {\n",
    "  WITH e\n",
    "  CALL db.index.vector.queryNodes('entity', 10, e.embedding)\n",
    "  YIELD node, score\n",
    "  WITH node, score\n",
    "  WHERE score > toFLoat($cutoff)\n",
    "      AND (toLower(node.name) CONTAINS toLower(e.name) OR toLower(e.name) CONTAINS toLower(node.name)\n",
    "           OR apoc.text.distance(toLower(node.name), toLower(e.name)) < $distance)\n",
    "      AND labels(e) = labels(node)\n",
    "  WITH node, score\n",
    "  ORDER BY node.name\n",
    "  RETURN collect(node) AS nodes\n",
    "}\n",
    "WITH distinct nodes\n",
    "WHERE size(nodes) > 1\n",
    "WITH collect([n in nodes | n.name]) AS results\n",
    "UNWIND range(0, size(results)-1, 1) as index\n",
    "WITH results, index, results[index] as result\n",
    "WITH apoc.coll.sort(reduce(acc = result, index2 IN range(0, size(results)-1, 1) |\n",
    "        CASE WHEN index <> index2 AND\n",
    "            size(apoc.coll.intersection(acc, results[index2])) > 0\n",
    "            THEN apoc.coll.union(acc, results[index2])\n",
    "            ELSE acc\n",
    "        END\n",
    ")) as combinedResult\n",
    "WITH distinct(combinedResult) as combinedResult\n",
    "// extra filtering\n",
    "WITH collect(combinedResult) as allCombinedResults\n",
    "UNWIND range(0, size(allCombinedResults)-1, 1) as combinedResultIndex\n",
    "WITH allCombinedResults[combinedResultIndex] as combinedResult, combinedResultIndex, allCombinedResults\n",
    "WHERE NOT any(x IN range(0,size(allCombinedResults)-1,1)\n",
    "    WHERE x <> combinedResultIndex\n",
    "    AND apoc.coll.containsAll(allCombinedResults[x], combinedResult)\n",
    ")\n",
    "RETURN combinedResult\n",
    "\"\"\", param_map={'cutoff': similarity_threshold, 'distance': word_edit_distance})\n",
    "for row in data:\n",
    "    print(row)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'count(*)': 90}]"
      ]
     },
     "execution_count": 15,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "graph_store.structured_query(\"\"\"\n",
    "MATCH (e:__Entity__)\n",
    "CALL {\n",
    "  WITH e\n",
    "  CALL db.index.vector.queryNodes('entity', 10, e.embedding)\n",
    "  YIELD node, score\n",
    "  WITH node, score\n",
    "  WHERE score > toFLoat($cutoff)\n",
    "      AND (toLower(node.name) CONTAINS toLower(e.name) OR toLower(e.name) CONTAINS toLower(node.name)\n",
    "           OR apoc.text.distance(toLower(node.name), toLower(e.name)) < $distance)\n",
    "      AND labels(e) = labels(node)\n",
    "  WITH node, score\n",
    "  ORDER BY node.name\n",
    "  RETURN collect(node) AS nodes\n",
    "}\n",
    "WITH distinct nodes\n",
    "WHERE size(nodes) > 1\n",
    "WITH collect([n in nodes | n.name]) AS results\n",
    "UNWIND range(0, size(results)-1, 1) as index\n",
    "WITH results, index, results[index] as result\n",
    "WITH apoc.coll.sort(reduce(acc = result, index2 IN range(0, size(results)-1, 1) |\n",
    "        CASE WHEN index <> index2 AND\n",
    "            size(apoc.coll.intersection(acc, results[index2])) > 0\n",
    "            THEN apoc.coll.union(acc, results[index2])\n",
    "            ELSE acc\n",
    "        END\n",
    ")) as combinedResult\n",
    "WITH distinct(combinedResult) as combinedResult\n",
    "// extra filtering\n",
    "WITH collect(combinedResult) as allCombinedResults\n",
    "UNWIND range(0, size(allCombinedResults)-1, 1) as combinedResultIndex\n",
    "WITH allCombinedResults[combinedResultIndex] as combinedResult, combinedResultIndex, allCombinedResults\n",
    "WHERE NOT any(x IN range(0,size(allCombinedResults)-1,1)\n",
    "    WHERE x <> combinedResultIndex\n",
    "    AND apoc.coll.containsAll(allCombinedResults[x], combinedResult)\n",
    ")\n",
    "CALL {\n",
    "  WITH combinedResult\n",
    "\tUNWIND combinedResult AS name\n",
    "\tMATCH (e:__Entity__ {name:name})\n",
    "\tWITH e\n",
    "\tORDER BY size(e.name) DESC // prefer longer names to remain after merging\n",
    "\tRETURN collect(e) AS nodes\n",
    "}\n",
    "CALL apoc.refactor.mergeNodes(nodes, {properties: {\n",
    "    `.*`: 'discard'\n",
    "}})\n",
    "YIELD node\n",
    "RETURN count(*)\n",
    "\"\"\", param_map={'cutoff': similarity_threshold, 'distance': word_edit_distance})"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# custom retriever"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "metadata": {},
   "outputs": [],
   "source": [
    "from pydantic import BaseModel\n",
    "from typing import Optional, List\n",
    "\n",
    "\n",
    "class Entities(BaseModel):\n",
    "    \"\"\"List of named entities in the text such as names of people, organizations, concepts, and locations\"\"\"\n",
    "    names: Optional[List[str]]\n",
    "\n",
    "\n",
    "prompt_template_entities = \"\"\"\n",
    "Extract all named entities such as names of people, organizations, concepts, and locations\n",
    "from the following text:\n",
    "{text}\n",
    "\"\"\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "metadata": {},
   "outputs": [],
   "source": [
    "from typing import Any, Optional\n",
    "\n",
    "from llama_index.core.embeddings import BaseEmbedding\n",
    "from llama_index.core.retrievers import CustomPGRetriever, VectorContextRetriever\n",
    "from llama_index.core.vector_stores.types import VectorStore\n",
    "from llama_index.program.openai import OpenAIPydanticProgram\n",
    "\n",
    "\n",
    "class MyCustomRetriever(CustomPGRetriever):\n",
    "    \"\"\"Custom retriever with cohere reranking.\"\"\"\n",
    "\n",
    "    def init(\n",
    "        self,\n",
    "        ## vector context retriever params\n",
    "        embed_model: Optional[BaseEmbedding] = None,\n",
    "        vector_store: Optional[VectorStore] = None,\n",
    "        similarity_top_k: int = 4,\n",
    "        path_depth: int = 1,\n",
    "        include_text: bool = True,\n",
    "        **kwargs: Any,\n",
    "    ) -> None:\n",
    "        \"\"\"Uses any kwargs passed in from class constructor.\"\"\"\n",
    "        self.entity_extraction = OpenAIPydanticProgram.from_defaults(\n",
    "            output_cls=Entities, prompt_template_str=prompt_template_entities\n",
    "        )\n",
    "        self.vector_retriever = VectorContextRetriever(\n",
    "            self.graph_store,\n",
    "            include_text=self.include_text,\n",
    "            embed_model=embed_model,\n",
    "            similarity_top_k=similarity_top_k,\n",
    "            path_depth=path_depth,\n",
    "        )\n",
    "\n",
    "    def custom_retrieve(self, query_str: str) -> str:\n",
    "        \"\"\"Define custom retriever with reranking.\n",
    "\n",
    "        Could return `str`, `TextNode`, `NodeWithScore`, or a list of those.\n",
    "        \"\"\"\n",
    "        entities = self.entity_extraction(text=query_str).names\n",
    "        result_nodes = []\n",
    "        if entities:\n",
    "            print(f\"Detected entities: {entities}\")\n",
    "            for entity in entities:\n",
    "                result_nodes.extend(self.vector_retriever.retrieve(entity))\n",
    "        else:\n",
    "            result_nodes.extend(self.vector_retriever.retrieve(query_str))\n",
    "        ## TMP: please change\n",
    "        final_text = \"\\n\\n\".join(\n",
    "            [n.get_content(metadata_mode=\"llm\") for n in result_nodes]\n",
    "        )\n",
    "        return final_text\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "metadata": {},
   "outputs": [],
   "source": [
    "from llama_index.core.query_engine import RetrieverQueryEngine\n",
    "\n",
    "custom_sub_retriever = MyCustomRetriever(\n",
    "    index.property_graph_store,\n",
    "    include_text=True,\n",
    "    vector_store=index.vector_store,\n",
    "    embed_model=embed_model\n",
    ")\n",
    "\n",
    "query_engine = RetrieverQueryEngine.from_args(\n",
    "    index.as_retriever(sub_retrievers=[custom_sub_retriever]), llm=llm\n",
    ")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Detected entities: ['Chevron']\n",
      "Chevron is a company listed on the NYSE (New York Stock Exchange) and provides stock and balance sheet information. It has a strong balance sheet and has seen a decline in its stock price by about 10% over the past 90 days, despite a significant rise in Q2 consensus earnings estimates. Additionally, JHVEPhoto is a competitor of Chevron.\n"
     ]
    }
   ],
   "source": [
    "# response = query_engine.query(\"What do you know about Maliek Collins or Darragh O’Brien?\")\n",
    "response = query_engine.query(\"Do you know anything about Chevron?\")\n",
    "print(str(response))"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": ".ragvenv",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.12.3"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
